Tekla.Structures.DirectManipulation.Adapter.Session.NullableJsonConverter
The Tekla.Structures.DirectManipulation.Adapter.Session.NullableJsonConverter class is used to convert the nullable struct from/to JSON.

Tekla.Structures.DirectManipulation.Adapter.Session.NullableJsonConverter.CanWrite
Gets a value indicating whether this Newtonsoft.Json.JsonConverter can write JSON.
true if this Newtonsoft.Json.JsonConverter can write JSON; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Session.NullableJsonConverter.WriteJson(Newtonsoft.Json.JsonWriter,System.Object,Newtonsoft.Json.JsonSerializer)
Writes the JSON representation of the object.
writer: The Newtonsoft.Json.JsonWriter to write to.
value: The value.
serializer: The calling serializer.

Tekla.Structures.DirectManipulation.Adapter.Session.NullableJsonConverter.CanConvert(System.Type)
Determines whether this instance can convert the specified object type.
objectType: Type of the object.
Returns: true if this instance can convert the specified object type; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Session.NullableJsonConverter.ReadJson(Newtonsoft.Json.JsonReader,System.Type,System.Object,Newtonsoft.Json.JsonSerializer)
Reads the JSON representation of the object.
reader: The Newtonsoft.Json.JsonReader to read from.
objectType: Type of the object.
existingValue: The existing value of object being read.
serializer: The calling serializer.
Returns: The object value.